# Используем официальный урезанный образ Python, соответствующий нашей версии разработки
FROM python:3.13-slim

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Устанавливаем Poetry
# --no-cache-dir уменьшает размер итогового образа
RUN pip install --no-cache-dir poetry

# Копируем файлы проекта, которые определяют зависимости
COPY poetry.lock pyproject.toml ./

# Устанавливаем зависимости проекта, не включая dev-зависимости
# --no-root говорит Poetry не устанавливать сам проект как пакет
RUN poetry install --no-dev --no-root

# Копируем весь остальной код приложения
COPY . .

# Указываем команду для запуска бота при старте контейнера
CMD ["poetry", "run", "python", "main.py"]
